{
    "nodes": [
        {
            "play_name": "Julius Caesar",
            "id": "Julius Caesar",
            "fill": "rgb(100, 149, 237)",
            "role": "Roman general",
            "description": "Caesar is a general and the most powerful man in Rome. He begins the play as a victorious leader returning from battle. The people of Rome even offer to make him king and he seems to enjoy his power, even though he refuses the crown. Seen as too ambitious by the conspirators, he is eventually murdered by them to protect Rome and its ideals as a republic."
        },
        {
            "play_name": "Julius Caesar",
            "id": "Calphurnia",
            "fill": "rgb(255, 182, 193)",
            "role": "Julius Caesar's wife",
            "description": "Calphurnia is Caesar’s wife. She has come to believe in signs and omens? as warnings of the future. After having terrible nightmares and hearing reports of many bad omens, she warns Caesar against going to the Senate on the Ides of March. She also tells Caesar that his over-confidence is leading him to make bad decisions. After listening to her, Caesar agrees to stay but later changes his mind and Calphurnia’s advice is ignored."
        },
        {
            "play_name": "Julius Caesar",
            "id": "Marcus Brutus",
            "fill": "rgb(100, 149, 237)",
            "role": "senator",
            "description": "Brutus is a politician in the Roman republic. At the start of the play, he is worried that the people want Caesar to be king and to have complete power. When Cassius tells him he is worried about the same thing, Brutus joins him in a plot to assassinate Caesar. Brutus is convinced that killing Caesar is the right thing to do but after he is forced to flee and his loyal wife, Portia, commits suicide because of his actions, Brutus become more troubled. When Brutus senses defeat in battle, he takes his own life."
        },
        {
            "play_name": "Julius Caesar",
            "id": "Portia",
            "fill": "rgb(255, 182, 193)",
            "role": "Marcus Brutus' wife",
            "description": "Portia is Brutus' wife and the daughter of a noble Roman called Cato. She is used to being Brutus’ confidante and is upset when he doesn’t tell her what is happening and why he is worried. When Brutus eventually tells her about the plot, she is nervous about the danger he is in. She later kills herself after he has run away, out of grief that he is gone and his enemies have become so powerful."
        },
        {
            "play_name": "Julius Caesar",
            "id": "Cassius",
            "fill": "rgb(100, 149, 237)",
            "role": "patricians",
            "description": "Cassius is a talented general and supporter of the Roman republic. He dislikes the fact that Caesar has become like a king in the eyes of the Roman citizens and leads his friend Brutus to believe that Caesar must die. He is impulsive and deceptive, sending Brutus forged letters to convince him to murder Caesar. He is shrewd? and understands how the political world works but his friendship with Brutus means a lot to him. Despite never believing in omens, he starts to see signs of failure and loses confidence. When he senses defeat in battle, he knows it is time to die and kills himself with the blade that stabbed Caesar."
        },
        {
            "play_name": "Julius Caesar",
            "id": "Pindarus",
            "fill": "rgb(100, 149, 237)",
            "role": "slave",
            "description": NaN
        },
        {
            "play_name": "Julius Caesar",
            "id": "Octavius",
            "fill": "rgb(100, 149, 237)",
            "role": "rulers of Rome",
            "description": "Octavius Caesar is a small but important role in the play. He is Caesar’s nephew and chosen heir, meaning that Octavius will rule Rome after Caesar dies. He is also an important friend to Antony and raises an army with him to fight Brutus and the conspirators. Octavius, together with Antony and Lepidus, forms the next Triumvirate to rule Rome at the end of the play."
        },
        {
            "play_name": "Julius Caesar",
            "id": "Lucius",
            "fill": "rgb(100, 149, 237)",
            "role": "servant to Marcus Brutus",
            "description": NaN
        },
        {
            "play_name": "The Merchant of Venice",
            "id": "The Prince of Morocco",
            "fill": "rgb(100, 149, 237)",
            "role": "suitor to Portia",
            "description": NaN
        },
        {
            "play_name": "The Merchant of Venice",
            "id": "The Prince of Arragon",
            "fill": "rgb(100, 149, 237)",
            "role": "suitor to Portia",
            "description": NaN
        },
        {
            "play_name": "The Merchant of Venice",
            "id": "Antonio",
            "fill": "rgb(100, 149, 237)",
            "role": "a merchant of Venice",
            "description": "Antonio is the Venetian merchant described in the title of the play. He is extremely well liked by most characters apart from Shylock. Although Antonio is inexplicably sad at the start of the play, he is in a relatively secure position. Although he has no readily available cash, he has plenty of ships carrying fortunes at sea. As the play goes on his position becomes increasingly precarious as he has entered into a dangerous deal with Shylock, which nearly costs him his life."
        },
        {
            "play_name": "The Merchant of Venice",
            "id": "Bassanio",
            "fill": "rgb(100, 149, 237)",
            "role": "suitor to Portia",
            "description": "Bassanio is a young Venetian gentleman who is a close friend of Antonio’s and in love with Portia. In order to woo Portia he needs money and so asks Antonio for a loan. It is this request which results in Antonio becoming ‘bound’ to Shylock and in danger of losing his life."
        },
        {
            "play_name": "The Merchant of Venice",
            "id": "Solanio",
            "fill": "rgb(100, 149, 237)",
            "role": NaN,
            "description": NaN
        },
        {
            "play_name": "The Merchant of Venice",
            "id": "Salarino",
            "fill": "rgb(100, 149, 237)",
            "role": NaN,
            "description": NaN
        },
        {
            "play_name": "The Merchant of Venice",
            "id": "Gratiano",
            "fill": "rgb(100, 149, 237)",
            "role": NaN,
            "description": "Gratiano is a Venetian man who is friends with Bassanio and Antonio. He is renowned for his wild and boisterous behaviour and heavily insults Shylock at the start of the play. Gratiano accompanies Bassanio to Belmont and falls in love with Nerissa, Portia’s waiting woman."
        },
        {
            "play_name": "The Merchant of Venice",
            "id": "Lorenzo",
            "fill": "rgb(100, 149, 237)",
            "role": NaN,
            "description": "Lorenzo is a Venetian and a Christian, who is friends with Bassiano, Gratiano and Antonio. Lorenzo is in love with Jessica, Shylock’s daughter and helps her to escape from her father’s house so that they can run away and marry."
        },
        {
            "play_name": "The Merchant of Venice",
            "id": "Shylock",
            "fill": "rgb(100, 149, 237)",
            "role": "a Jewish moneylender in Venice",
            "description": "Shylock is a moneylender who lives in Venice. He is Jewish and receives a great deal of abuse for his religion. Shylock lends money to Antonio on the condition that if Antonio cannot pay him back by the appointed time then Shylock will cut away a pound of Antonio’s flesh. As the play progresses, Shylock becomes completely fixated on his ‘bond’ with Antonio and desperate to claim revenge on the merchant, who has treated him badly in the past."
        },
        {
            "play_name": "The Merchant of Venice",
            "id": "Tubal",
            "fill": "rgb(100, 149, 237)",
            "role": "another Jewish moneylender",
            "description": "Tubal is a wealthy Jewish friend of Shylock’s. Shylock doesn’t have enough money himself to lend to Antonio, so he borrows the funds from Tubal. When Jessica, Shylock’s daughter, goes missing, Tubal goes in search of her in order to help his friend."
        },
        {
            "play_name": "The Merchant of Venice",
            "id": "Lancelet Gobbo",
            "fill": "rgb(100, 149, 237)",
            "role": "clown, servant to Shylock",
            "description": "Lancelet is the ‘clown’ of the play and much of the comedy derives from him playing tricks on his father and making silly jokes. He works for Shylock, but passionately dislikes his master and so asks Bassanio if he can work for him instead. When Bassanio agrees, Lancelet accompanies Bassanio to Belmont."
        },
        {
            "play_name": "The Merchant of Venice",
            "id": "Old Gobbo",
            "fill": "rgb(100, 149, 237)",
            "role": "blind Lancelet's father",
            "description": NaN
        },
        {
            "play_name": "The Merchant of Venice",
            "id": "Leonardo",
            "fill": "rgb(100, 149, 237)",
            "role": "servant to Bassanio",
            "description": NaN
        },
        {
            "play_name": "The Merchant of Venice",
            "id": "Balthasar",
            "fill": "rgb(100, 149, 237)",
            "role": "servant to Portia",
            "description": NaN
        },
        {
            "play_name": "The Merchant of Venice",
            "id": "Stephano",
            "fill": "rgb(100, 149, 237)",
            "role": "servant to Portia",
            "description": NaN
        },
        {
            "play_name": "The Merchant of Venice",
            "id": "Portia",
            "fill": "rgb(255, 182, 193)",
            "role": "rich heiress",
            "description": "Portia is a wealthy heiress who lives in Belmont. Her father has died and in his will wrote that anyone wanting to marry his daughter must succeed in a specially designed challenge. Suitors have to choose between three caskets (either gold, silver or lead), guessing which one holds Portia’s portrait. Portia is not at all keen on most of the men who have tried to win her, however she does fall in love with Bassanio. Ultimately she plays an essential role in ensuring that Antonio’s life is saved, as she prevents Shylock from claiming his ‘pound of flesh’."
        },
        {
            "play_name": "The Merchant of Venice",
            "id": "Nerissa",
            "fill": "rgb(255, 182, 193)",
            "role": "Portia's waiting maid",
            "description": "Nerissa is Portia’s waiting woman and friend. They have a close relationship and Nerissa both teases and advises her boss. She also assists Portia in helping to get Antonio freed and goes with Portia to Venice, dressed as a lawyer’s clerk. Nerissa falls in love with Bassanio’s friend Gratiano, who asks for her hand in marriage after Bassanio ‘wins’ Portia."
        },
        {
            "play_name": "The Merchant of Venice",
            "id": "Jessica",
            "fill": "rgb(255, 182, 193)",
            "role": "Shylock's daughter ",
            "description": "Jessica is Shylock’s daughter and at the start of the play is living in his house. She is in love with a Christian, Lorenzo. Jessica knows that her father will never give his consent for her to marry a Christian and so she plans to secretly escape one night in order to run away with Lorenzo, marry him and convert from Judaism to Christianity."
        },
        {
            "play_name": "A Midsummer Night's Dream",
            "id": "Theseus",
            "fill": "rgb(100, 149, 237)",
            "role": "Duke of Athens",
            "description": "Theseus is the Duke of Athens. At the start of the play we find him talking to Hippolyta, his fiancée, about their upcoming marriage. He is soon interrupted by Egeus and has to make a judgement about Hermia’s behaviour. At the end of the play he overrules Egeus and allows the lovers to get married at the same time as him and Hippolyta."
        },
        {
            "play_name": "A Midsummer Night's Dream",
            "id": "Egeus",
            "fill": "rgb(100, 149, 237)",
            "role": "a courtier in Athens",
            "description": "Egeus is a courtier in Athens. His daughter Hermia is in love with Lysander, a gentleman of the court, but he wants her to marry Demetrius. He asks the Duke’s permission for his daughter to either marry Demetrius or be put to her death – as is decreed in an old law. By the end of the play he still wants Hermia to marry Demetrius but he is overruled by Duke Theseus."
        },
        {
            "play_name": "A Midsummer Night's Dream",
            "id": "Lysander",
            "fill": "rgb(100, 149, 237)",
            "role": "young gentleman ",
            "description": "Lysander is a young gentleman in the court. He is in love with Hermia and she with him. Unfortunately, Hermia’s father, Egeus, wants her to marry Demetrius. Lysander and Hermia decide to run away together but they are followed by Demetrius and Helena. Whilst there, Lysander has a magic spell put on him which makes him accidently fall in love with Helena. The spell is eventually lifted and by the end of the play he and Hermia have married each other."
        },
        {
            "play_name": "A Midsummer Night's Dream",
            "id": "Demeterius",
            "fill": "rgb(100, 149, 237)",
            "role": "young gentleman ",
            "description": "Demetrius is a young gentleman in the court, who used to be in a relationship with Helena. He is now in love with Hermia and has her father’s blessing to marry her. He follows Hermia into the forest when he learns from Helena that she has run away with Lysander. While in the forest he has a magic spell put on him that makes him fall in love with Helena. At the end of the play he recognises that he has loved Helena all along and they get married."
        },
        {
            "play_name": "A Midsummer Night's Dream",
            "id": "Philostrate",
            "fill": "rgb(100, 149, 237)",
            "role": "master of the revels",
            "description": "Theseus’s Master of the Revels, responsible for organizing the entertainment for the duke’s marriage celebration."
        },
        {
            "play_name": "A Midsummer Night's Dream",
            "id": "Hippolyta",
            "fill": "rgb(255, 182, 193)",
            "role": "queen of the Amazons",
            "description": "The legendary queen of the Amazons, engaged to Theseus. Like Theseus, she symbolizes order."
        },
        {
            "play_name": "A Midsummer Night's Dream",
            "id": "Hermia",
            "fill": "rgb(255, 182, 193)",
            "role": "Egeus' daughter ",
            "description": "Hermia is a young woman in Athens and Egeus’ daughter. She is in love with Lysander but unfortunately Egeus wants her to marry Demetrius. Egeus invokes an ancient law that states he can choose his daughter’s husband or she will be put to death. The Duke Theseus upholds the law and condemns Hermia to death. She and Lysander decide to elope to escape the judgement. In the woods they are chased by Demetrius and Helena, Hermia’s best friend. Whilst there Lysander and Demetrius fall under a magic spell that makes them both fall in love with Helena. A huge argument ensues before more magic is used to work out all the problems. At the end of the play Theseus overrules Egeus, with Hermia and Lysander marrying."
        },
        {
            "play_name": "A Midsummer Night's Dream",
            "id": "Helena",
            "fill": "rgb(255, 182, 193)",
            "role": "young woman in Athens",
            "description": "Helena is a young woman in Athens. She is in love with Demetrius but he is not in love with her. Instead, he loves her best friend Hermia. As a way of convincing Demetrius to love her, Helena tells him about Hermia’s plan to run away with Lysander and together they go into the forest to find her. While there, Lysander and Demetrius fall under a magic spell that makes them both fall in love with Helena. She is confused, enraged and upset by this turn of events, eventually falling out with Hermia. By the end of the play, Demetrius falls in love with her and they get married."
        },
        {
            "play_name": "Hamlet",
            "id": "Hamlet",
            "fill": "rgb(100, 149, 237)",
            "role": "son of the late King and Gertrude, nephew of Claudius",
            "description": "The Prince of Denmark, the title character, and the protagonist. About thirty years old at the start of the play, Hamlet is the son of Queen Gertrude and the late King Hamlet, and the nephew of the present king, Claudius. Hamlet is melancholy, bitter, and cynical, full of hatred for his uncle’s scheming and disgust for his mother’s sexuality. A reflective and thoughtful young man who has studied at the University of Wittenberg, Hamlet is often indecisive and hesitant, but at other times prone to rash and impulsive acts."
        },
        {
            "play_name": "Hamlet",
            "id": "Claudius",
            "fill": "rgb(100, 149, 237)",
            "role": "king of Danmark",
            "description": "The King of Denmark, Hamlet’s uncle, and the play’s antagonist. The villain of the play, Claudius is a calculating, ambitious politician, driven by his sexual appetites and his lust for power, but he occasionally shows signs of guilt and human feeling—his love for Gertrude, for instance, seems sincere."
        },
        {
            "play_name": "Hamlet",
            "id": "Gertrude",
            "fill": "rgb(255, 182, 193)",
            "role": "queen of Danmark, mother of Hamlet",
            "description": "The Queen of Denmark, Hamlet’s mother, recently married to Claudius. Gertrude loves Hamlet deeply, but she is a shallow, weak woman who seeks affection and status more urgently than moral rectitude or truth."
        },
        {
            "play_name": "Hamlet",
            "id": "Polonius",
            "fill": "rgb(100, 149, 237)",
            "role": "lord Chamberlain",
            "description": "The Lord Chamberlain of Claudius’s court, a pompous, conniving old man. Polonius is the father of Laertes and Ophelia."
        },
        {
            "play_name": "Hamlet",
            "id": "Laertes",
            "fill": "rgb(100, 149, 237)",
            "role": "son of Polonius",
            "description": "Polonius’s son and Ophelia’s brother, a young man who spends much of the play in France. Passionate and quick to action, Laertes is clearly a foil for the reflective Hamlet."
        },
        {
            "play_name": "Hamlet",
            "id": "Ophelia",
            "fill": "rgb(255, 182, 193)",
            "role": "daughter of Polonius",
            "description": "Polonius’s daughter, a beautiful young woman with whom Hamlet has been in love. Ophelia is a sweet and innocent young girl, who obeys her father and her brother, Laertes. Dependent on men to tell her how to behave, she gives in to Polonius’s schemes to spy on Hamlet. Even in her lapse into madness and death, she remains maidenly, singing songs about flowers and finally drowning in the river amid the flower garlands she had gathered."
        },
        {
            "play_name": "Hamlet",
            "id": "Horatio",
            "fill": "rgb(100, 149, 237)",
            "role": "friend of Hamlet",
            "description": "Hamlet’s close friend, who studied with the prince at the university in Wittenberg. Horatio is loyal and helpful to Hamlet throughout the play. After Hamlet’s death, Horatio remains alive to tell Hamlet’s story."
        },
        {
            "play_name": "Hamlet",
            "id": "Reynaldo",
            "fill": "rgb(100, 149, 237)",
            "role": "servant of Polonius",
            "description": "Polonius’s servant, who is sent to France by Polonius to check up on and spy on Laertes."
        },
        {
            "play_name": "Macbeth",
            "id": "Macbeth",
            "fill": "rgb(100, 149, 237)",
            "role": "general of the king's army, afterwards king of scotland",
            "description": "Macbeth is a Scottish general and the thane of Glamis who is led to wicked thoughts by the prophecies of the three witches, especially after their prophecy that he will be made thane of Cawdor comes true. Macbeth is a brave soldier and a powerful man, but he is not a virtuous one. He is easily tempted into murder to fulfill his ambitions to the throne, and once he commits his first crime and is crowned King of Scotland, he embarks on further atrocities with increasing ease. Ultimately, Macbeth proves himself better suited to the battlefield than to political intrigue, because he lacks the skills necessary to rule without being a tyrant. His response to every problem is violence and murder. Unlike Shakespeare’s great villains, such as Iago in Othello, Macbeth is never comfortable in his role as a criminal. He is unable to bear the psychological consequences of his atrocities."
        },
        {
            "play_name": "Macbeth",
            "id": "Lady Macbeth",
            "fill": "rgb(255, 182, 193)",
            "role": "Macbeth's wife",
            "description": "Macbeth’s wife, a deeply ambitious woman who lusts for power and position. Early in the play, she seems to be the stronger and more ruthless of the two, as she urges her husband to kill Duncan and seize the crown. After the bloodshed begins, however, Lady Macbeth falls victim to guilt and madness to an even greater degree than her husband. Her conscience affects her to such an extent that she eventually commits suicide. Interestingly, she and Macbeth are presented as being deeply in love, and many of Lady Macbeth’s speeches imply that her influence over her husband is primarily sexual. Their joint alienation from the world, occasioned by their partnership in crime, seems to strengthen the attachment that they feel to each another."
        },
        {
            "play_name": "Macbeth",
            "id": "Banquo",
            "fill": "rgb(100, 149, 237)",
            "role": "general of the king's army",
            "description": "The brave, noble general whose children, according to the witches’ prophecy, will inherit the Scottish throne. Like Macbeth, Banquo thinks ambitious thoughts, but he does not translate those thoughts into action. In a sense, Banquo’s character stands as a rebuke to Macbeth, since he represents the path Macbeth chose not to take: a path in which ambition need not lead to betrayal and murder. Appropriately, then, it is Banquo’s ghost—and not Duncan’s—that haunts Macbeth. In addition to embodying Macbeth’s guilt for killing Banquo, the ghost also reminds Macbeth that he did not emulate Banquo’s reaction to the witches’ prophecy."
        },
        {
            "play_name": "Macbeth",
            "id": "king Duncan",
            "fill": "rgb(100, 149, 237)",
            "role": "king of Scotland",
            "description": "The good King of Scotland whom Macbeth, in his ambition for the crown, murders. Duncan is the model of a virtuous, benevolent, and farsighted ruler. His death symbolizes the destruction of an order in Scotland that can be restored only when Duncan’s line, in the person of Malcolm, once more occupies the throne."
        },
        {
            "play_name": "Macbeth",
            "id": "Malcom",
            "fill": "rgb(100, 149, 237)",
            "role": "son of king Duncan",
            "description": "The son of Duncan, whose restoration to the throne signals Scotland’s return to order following Macbeth’s reign of terror. Malcolm becomes a serious challenge to Macbeth with Macduff’s aid (and the support of England). Prior to this, he appears weak and uncertain of his own power, as when he and Donalbain flee Scotland after their father’s murder."
        },
        {
            "play_name": "Macbeth",
            "id": "Donalbain",
            "fill": "rgb(100, 149, 237)",
            "role": "king Duncan’s son, Malcolm’s younger brother.",
            "description": NaN
        },
        {
            "play_name": "Macbeth",
            "id": "Fleance",
            "fill": "rgb(100, 149, 237)",
            "role": "son of Banquo",
            "description": "Banquo’s son, who survives Macbeth’s attempt to murder him. At the end of the play, Fleance’s whereabouts are unknown. Presumably, he may come to rule Scotland, fulfilling the witches’ prophecy that Banquo’s sons will sit on the Scottish throne."
        },
        {
            "play_name": "Macbeth",
            "id": "Macduff",
            "fill": "rgb(100, 149, 237)",
            "role": "nobleman on Scotland",
            "description": "A Scottish nobleman hostile to Macbeth’s kingship from the start. He eventually becomes a leader of the crusade to unseat Macbeth. The crusade’s mission is to place the rightful king, Malcolm, on the throne, but Macduff also desires vengeance for Macbeth’s murder of Macduff’s wife and young son."
        },
        {
            "play_name": "Macbeth",
            "id": "Lady Macduff",
            "fill": "rgb(255, 182, 193)",
            "role": "Macduff's wife",
            "description": "Macduff’s wife. The scene in her castle provides our only glimpse of a domestic realm other than that of Macbeth and Lady Macbeth. She and her home serve as contrasts to Lady Macbeth and the hellish world of Inverness."
        },
        {
            "play_name": "Macbeth",
            "id": "Three witches",
            "fill": "rgb(205, 133, 63)",
            "role": "servants of Hecate",
            "description": "Three “black and midnight hags” who plot mischief against Macbeth using charms, spells, and prophecies. Their predictions prompt him to murder Duncan, to order the deaths of Banquo and his son, and to blindly believe in his own immortality. The play leaves the witches’ true identity unclear—aside from the fact that they are servants of Hecate, we know little about their place in the cosmos. In some ways, they resemble the mythological Fates, who impersonally weave the threads of human destiny. They clearly take a perverse delight in using their knowledge of the future to toy with and destroy human beings."
        },
        {
            "play_name": "Macbeth",
            "id": "Hecate",
            "fill": "rgb(205, 133, 63)",
            "role": "the goddess of witchcraft",
            "description": "The goddess of witchcraft, who helps the three witches work their mischief on Macbeth."
        },
        {
            "play_name": "Macbeth",
            "id": "Siward",
            "fill": "rgb(100, 149, 237)",
            "role": "earl of Northumberland, General of the English Forces",
            "description": NaN
        },
        {
            "play_name": "Macbeth",
            "id": "Young Siward",
            "fill": "rgb(100, 149, 237)",
            "role": "Siward's son",
            "description": NaN
        },
        {
            "play_name": "Macbeth",
            "id": "Boy",
            "fill": "rgb(100, 149, 237)",
            "role": "son of Macduff",
            "description": NaN
        },
        {
            "play_name": "Romeo and Juliet",
            "id": "Romeo",
            "fill": "rgb(100, 149, 237)",
            "role": "son of Montague",
            "description": "Romeo is the only child of Lord and Lady Montague. When we first meet him, he believes he is in love with Rosaline, but then he meets Juliet at a party. They instantly fall in love and are married in secret the next day. The pair are separated after Romeo kills Tybalt and is banished. A plan to reunite them goes wrong when Romeo believes Juliet is dead. At the end of the play, Romeo kills himself."
        },
        {
            "play_name": "Romeo and Juliet",
            "id": "Juliet",
            "fill": "rgb(255, 182, 193)",
            "role": "daughter of Capulet",
            "description": "Juliet is the only child of Lord and Lady Capulet. She has been promised in marriage to Paris. At a party, she meets Romeo and instantly falls in love with him, even though he is her ‘enemy’ and a Montague. Juliet marries Romeo in secret the next day but they are separated after Romeo kills her cousin Tybalt. In order to avoid marrying Paris, Juliet fakes her own death. Romeo believes her to be dead and kills himself. When she wakes up, and discovers his body, Juliet stabs herself with his dagger."
        },
        {
            "play_name": "Romeo and Juliet",
            "id": "Escalus",
            "fill": "rgb(100, 149, 237)",
            "role": "prince of Verona",
            "description": "The Prince of Verona. A kinsman of Mercutio and Paris. As the seat of political power in Verona, he is concerned about maintaining the public peace at all costs."
        },
        {
            "play_name": "Romeo and Juliet",
            "id": "Paris",
            "fill": "rgb(100, 149, 237)",
            "role": "a young nobleman, kinsman of the prince",
            "description": "Paris is a family member of the Prince and a nobleman. We first meet him when he asks Lord Capulet for permission to marry Juliet and then after Tybalt’s death, when he asks for permission to marry Juliet again. Despite not wanting to let him marry Juliet at first, Lord Capulet eventually agrees and sets a date for their marriage. When Juliet is believed to be dead, Paris visits her tomb to mourn but is interrupted by Romeo. They fight and Paris is killed."
        },
        {
            "play_name": "Romeo and Juliet",
            "id": "Lady Capulet",
            "fill": "rgb(255, 182, 193)",
            "role": "wife of Capulet",
            "description": "Lady Capulet is the wife of Lord Capulet. At the start of the play she tells her daughter Juliet about the proposal of marriage from Paris and is excited for her. She seeks justice for Tybalt’s murder and later tries to calm Lord Capulet down when Juliet refuses to marry Paris, although she walks away from Juliet herself at the end of the scene. At the end of the play she finds her daughter’s body."
        },
        {
            "play_name": "Romeo and Juliet",
            "id": "Lord Capulet",
            "fill": "rgb(100, 149, 237)",
            "role": "head of a noble family",
            "description": "Lord Capulet is the head of one of the noble families of Verona, the Capulets. He talks to Paris, who wants to marry his daughter Juliet, and suggests that Paris join them at a ball he is holding so that he and Juliet can meet. At the ball he stops Tybalt from fighting with Romeo, to keep the peace. Lord Capulet later decides that Juliet should marry Paris as soon as possible to help her get over the grief of Tybalt’s death. When she refuses he threatens to disown her. At the end of the play he makes peace with the Montague family."
        },
        {
            "play_name": "Romeo and Juliet",
            "id": "Lord Montague",
            "fill": "rgb(100, 149, 237)",
            "role": "head of a noble family",
            "description": "Lord Montague is the head of one of the noble families of Verona, the Montague. He is Romeo’s father. Lord Montague is enemiy with the Capulets but he reconciles with Lord and Lady Capulet after his son’s death, promising to build a statue in pure gold to honour Juliet."
        },
        {
            "play_name": "Romeo and Juliet",
            "id": "Lady Montague",
            "fill": "rgb(255, 182, 193)",
            "role": "wife of Montague",
            "description": "Lady Montague is the wife of Lord Montague and Romeo’s mother. She has to restrain her husband from fighting with the Capulets in the opening scene of the play and is grateful to find her son Romeo was not involved in the ‘fray’. She and her husband are both concerned about their son’s behaviour and how withdrawn he has been. Lady Montague later dies of ‘grief’ when Romeo is banished."
        },
        {
            "play_name": "Romeo and Juliet",
            "id": "Mercutio",
            "fill": "rgb(100, 149, 237)",
            "role": "nobleman on Verona",
            "description": "Mercutio is a family member of the prince and best friend of Romeo. We first meet him with Romeo and Benvolio just before the ball where he gives the famous ‘Queen Mab’ speech. Later, he challenges Tybalt to a fight which ends in his death and, as he dies, he calls down a ‘plague’ on both houses."
        },
        {
            "play_name": "Romeo and Juliet",
            "id": "Benvolio",
            "fill": "rgb(100, 149, 237)",
            "role": "nephew of Montague, friend of Romeo",
            "description": "Benvolio is Romeo’s cousin. At the start of the play he tries to stop the street brawl between the two households but is quickly drawn into it by Tybalt. He discovers that Romeo is upset because Rosaline doesn’t love him and tries to cheer Romeo up by convincing him to go to a party where he might meet other women who will take his mind off Rosaline. The next day he is present when Tybalt kills Mercutio and Romeo then kills Tybalt."
        },
        {
            "play_name": "Romeo and Juliet",
            "id": "Tybalt",
            "fill": "rgb(100, 149, 237)",
            "role": "nephew of Lady Capulet, \"Prince of Cats\"",
            "description": "Tybalt is the nephew of Lady Capulet. At the start of the play he is involved in a street brawl with the Montagues. Later, he is offended by Romeo’s presence at the Capulets’ ball but is calmed by Lord Capulet who does not want Tybalt to start an argument. The next day he searches for Romeo to get revenge for the insult but gets into a fight with Mercutio. He kills Mercutio in the fight. He is then killed by Romeo."
        },
        {
            "play_name": "Romeo and Juliet",
            "id": "Friar Laurence",
            "fill": "rgb(100, 149, 237)",
            "role": "a franciscan",
            "description": "Friar Laurence is a Franciscan monk. We first meet him the morning after the party when Romeo goes to him for permission to marry Juliet. Despite telling Romeo to slow down, he agrees to marry the young couple, as he believes it may be a way to end the feud between the Montagues and the Capulets. Later in the play, when Romeo is banished for killing Tybalt, Friar Laurence sends him to Mantua. He also gives Juliet the potion that will make her appear dead."
        },
        {
            "play_name": "Romeo and Juliet",
            "id": "Balthasar",
            "fill": "rgb(100, 149, 237)",
            "role": "servant of Romeo",
            "description": "Romeo’s dedicated servant, who brings Romeo the news of Juliet’s death, unaware that her death is a ruse."
        },
        {
            "play_name": "Romeo and Juliet",
            "id": "Sampson",
            "fill": "rgb(100, 149, 237)",
            "role": "servant of Capulet",
            "description": "A servant of the house of Capulet, who, like his master, hates the Montagues. At the outset of the play, with Gregory they successfully provoke some Montague men into a fight."
        },
        {
            "play_name": "Romeo and Juliet",
            "id": "Gregory",
            "fill": "rgb(100, 149, 237)",
            "role": "servant of Capulet",
            "description": "A servants of the house of Capulet, who, like his master, hates the Montagues. At the outset of the play, with Sampson they successfully provoke some Montague men into a fight."
        },
        {
            "play_name": "Romeo and Juliet",
            "id": "Peter",
            "fill": "rgb(100, 149, 237)",
            "role": "servant of Capulet",
            "description": "A Capulet servant who invites guests to Capulet’s feast and escorts the Nurse to meet with Romeo. He is illiterate, and a bad singer."
        },
        {
            "play_name": "Romeo and Juliet",
            "id": "Abram",
            "fill": "rgb(100, 149, 237)",
            "role": "servant of Montague",
            "description": "Montague’s servant, who fights with Sampson and Gregory in the first scene of the play."
        },
        {
            "play_name": "Romeo and Juliet",
            "id": "the Nurse ",
            "fill": "rgb(255, 182, 193)",
            "role": "nurse of Juliet",
            "description": "Juliet’s nurse, the woman who breast-fed Juliet when she was a baby and has cared for Juliet her entire life. A vulgar, long-winded, and sentimental character, the Nurse provides comic relief with her frequently inappropriate remarks and speeches. But, until a disagreement near the play’s end, the Nurse is Juliet’s faithful confidante and loyal intermediary in Juliet’s affair with Romeo. She provides a contrast with Juliet, given that her view of love is earthy and sexual, whereas Juliet is idealistic and intense. The Nurse believes in love and wants Juliet to have a nice-looking husband, but the idea that Juliet would want to sacrifice herself for love is incomprehensible to her."
        },
        {
            "play_name": "Romeo and Juliet",
            "id": "Rosaline",
            "fill": "rgb(255, 182, 193)",
            "role": NaN,
            "description": "The woman with whom Romeo is infatuated at the beginning of the play. Rosaline never appears onstage, but it is said by other characters that she is very beautiful and has sworn to live a life of chastity."
        }
    ],
    "edges": [
        {
            "play_name": "Julius Caesar",
            "from": "Julius Caesar",
            "to": "Calphurnia",
            "label": "husband"
        },
        {
            "play_name": "Julius Caesar",
            "from": "Octavius",
            "to": "Julius Caesar",
            "label": "nephew and heir"
        },
        {
            "play_name": "Julius Caesar",
            "from": "Marcus Brutus",
            "to": "Julius Caesar",
            "label": "enemy"
        },
        {
            "play_name": "Julius Caesar",
            "from": "Lucius",
            "to": "Marcus Brutus",
            "label": "servant"
        },
        {
            "play_name": "Julius Caesar",
            "from": "Marcus Brutus",
            "to": "Portia",
            "label": "husband"
        },
        {
            "play_name": "Julius Caesar",
            "from": "Marcus Brutus",
            "to": "Cassius",
            "label": "brother-in-law"
        },
        {
            "play_name": "Julius Caesar",
            "from": "Pindarus",
            "to": "Cassius",
            "label": "servant"
        },
        {
            "play_name": "The Merchant of Venice",
            "from": "The Prince of Morocco",
            "to": "Portia",
            "label": "lover"
        },
        {
            "play_name": "The Merchant of Venice",
            "from": "The Prince of Arragon",
            "to": "Portia",
            "label": "lover"
        },
        {
            "play_name": "The Merchant of Venice",
            "from": "Antonio",
            "to": "Bassanio",
            "label": "friend"
        },
        {
            "play_name": "The Merchant of Venice",
            "from": "Antonio",
            "to": "Shylock",
            "label": "enemy"
        },
        {
            "play_name": "The Merchant of Venice",
            "from": "Solanio",
            "to": "Antonio",
            "label": "friend"
        },
        {
            "play_name": "The Merchant of Venice",
            "from": "Solanio",
            "to": "Bassanio",
            "label": "friend"
        },
        {
            "play_name": "The Merchant of Venice",
            "from": "Salarino",
            "to": "Antonio",
            "label": "friend"
        },
        {
            "play_name": "The Merchant of Venice",
            "from": "Salarino",
            "to": "Bassanio",
            "label": "friend"
        },
        {
            "play_name": "The Merchant of Venice",
            "from": "Lorenzo",
            "to": "Antonio",
            "label": "friend"
        },
        {
            "play_name": "The Merchant of Venice",
            "from": "Lorenzo",
            "to": "Bassanio",
            "label": "friend"
        },
        {
            "play_name": "The Merchant of Venice",
            "from": "Gratiano",
            "to": "Antonio",
            "label": "friend"
        },
        {
            "play_name": "The Merchant of Venice",
            "from": "Gratiano",
            "to": "Bassanio",
            "label": "friend"
        },
        {
            "play_name": "The Merchant of Venice",
            "from": "Gratiano",
            "to": "Nerissa",
            "label": "lover"
        },
        {
            "play_name": "The Merchant of Venice",
            "from": "Lorenzo",
            "to": "Jessica",
            "label": "lover"
        },
        {
            "play_name": "The Merchant of Venice",
            "from": "Lorenzo",
            "to": "Shylock",
            "label": "enemy"
        },
        {
            "play_name": "The Merchant of Venice",
            "from": "Shylock",
            "to": "Jessica",
            "label": "father"
        },
        {
            "play_name": "The Merchant of Venice",
            "from": "Tubal",
            "to": "Shylock",
            "label": "friend"
        },
        {
            "play_name": "The Merchant of Venice",
            "from": "Lancelet Gobbo",
            "to": "Shylock",
            "label": "servant, ennemy"
        },
        {
            "play_name": "The Merchant of Venice",
            "from": "Lancelet Gobbo",
            "to": "Jessica",
            "label": "friend"
        },
        {
            "play_name": "The Merchant of Venice",
            "from": "Old Gobbo",
            "to": "Lancelet Gobbo",
            "label": "father"
        },
        {
            "play_name": "The Merchant of Venice",
            "from": "Leonardo",
            "to": "Bassanio",
            "label": "servant"
        },
        {
            "play_name": "The Merchant of Venice",
            "from": "Balthasar",
            "to": "Portia",
            "label": "servant"
        },
        {
            "play_name": "The Merchant of Venice",
            "from": "Stephano",
            "to": "Portia",
            "label": "servant"
        },
        {
            "play_name": "The Merchant of Venice",
            "from": "Nerissa",
            "to": "Portia",
            "label": "wainting maid"
        },
        {
            "play_name": "A Midsummer Night's Dream",
            "from": "Egeus",
            "to": "Hermia",
            "label": "father"
        },
        {
            "play_name": "A Midsummer Night's Dream",
            "from": "Lysander",
            "to": "Hermia",
            "label": "lover"
        },
        {
            "play_name": "A Midsummer Night's Dream",
            "from": "Philostrate",
            "to": "Theseus",
            "label": "master of the revels"
        },
        {
            "play_name": "A Midsummer Night's Dream",
            "from": "Helena",
            "to": "Hermia",
            "label": "friend"
        },
        {
            "play_name": "A Midsummer Night's Dream",
            "from": "Demeterius",
            "to": "Hermia",
            "label": "enemy"
        },
        {
            "play_name": "A Midsummer Night's Dream",
            "from": "Helena",
            "to": "Lysander",
            "label": "lover"
        },
        {
            "play_name": "A Midsummer Night's Dream",
            "from": "Hippolyta",
            "to": "Theseus",
            "label": "bethrothed"
        },
        {
            "play_name": "A Midsummer Night's Dream",
            "from": "Theseus",
            "to": "Egeus",
            "label": "friend"
        },
        {
            "play_name": "Hamlet",
            "from": "Hamlet",
            "to": "Claudius",
            "label": "nephew"
        },
        {
            "play_name": "Hamlet",
            "from": "Gertrude",
            "to": "Hamlet",
            "label": "mother"
        },
        {
            "play_name": "Hamlet",
            "from": "Polonius",
            "to": "Laertes",
            "label": "father"
        },
        {
            "play_name": "Hamlet",
            "from": "Polonius",
            "to": "Ophelia",
            "label": "father"
        },
        {
            "play_name": "Hamlet",
            "from": "Ophelia",
            "to": "Laertes",
            "label": "sister"
        },
        {
            "play_name": "Hamlet",
            "from": "Horatio",
            "to": "Hamlet",
            "label": "friend"
        },
        {
            "play_name": "Hamlet",
            "from": "Reynaldo",
            "to": "Polonius",
            "label": "servant"
        },
        {
            "play_name": "Macbeth",
            "from": "Macbeth",
            "to": "Lady Macbeth",
            "label": "husband"
        },
        {
            "play_name": "Macbeth",
            "from": "Three witches",
            "to": "Macbeth",
            "label": "enemy"
        },
        {
            "play_name": "Macbeth",
            "from": "Three witches",
            "to": "Hecate",
            "label": "servant"
        },
        {
            "play_name": "Macbeth",
            "from": "Banquo",
            "to": "Fleance",
            "label": "father"
        },
        {
            "play_name": "Macbeth",
            "from": "Macduff",
            "to": "Lady Macduff",
            "label": "husband"
        },
        {
            "play_name": "Macbeth",
            "from": "Siward",
            "to": "Young Siward",
            "label": "father"
        },
        {
            "play_name": "Macbeth",
            "from": "Macduff",
            "to": "Boy",
            "label": "father"
        },
        {
            "play_name": "Macbeth",
            "from": "king Duncan",
            "to": "Malcom",
            "label": "father"
        },
        {
            "play_name": "Macbeth",
            "from": "Donalbain",
            "to": "Malcom",
            "label": "brother"
        },
        {
            "play_name": "Macbeth",
            "from": "Hecate",
            "to": "Macbeth",
            "label": "enemy"
        },
        {
            "play_name": "Macbeth",
            "from": "Macbeth",
            "to": "Lady Macduff",
            "label": "killer"
        },
        {
            "play_name": "Macbeth",
            "from": "Macbeth",
            "to": "Banquo",
            "label": "killer"
        },
        {
            "play_name": "Macbeth",
            "from": "Macbeth",
            "to": "king Duncan",
            "label": "killer"
        },
        {
            "play_name": "Macbeth",
            "from": "Macbeth",
            "to": "Young Siward",
            "label": "killer"
        },
        {
            "play_name": "Macbeth",
            "from": "Macbeth",
            "to": "Boy",
            "label": "killer"
        },
        {
            "play_name": "Macbeth",
            "from": "Macduff",
            "to": "Macbeth",
            "label": "enemy"
        },
        {
            "play_name": "Romeo and Juliet",
            "from": "Romeo",
            "to": "Juliet",
            "label": "lover"
        },
        {
            "play_name": "Romeo and Juliet",
            "from": "Lord Capulet",
            "to": "Juliet",
            "label": "father"
        },
        {
            "play_name": "Romeo and Juliet",
            "from": "Lady Capulet",
            "to": "Juliet",
            "label": "mother"
        },
        {
            "play_name": "Romeo and Juliet",
            "from": "Lord Capulet",
            "to": "Lady Capulet",
            "label": "husband"
        },
        {
            "play_name": "Romeo and Juliet",
            "from": "Paris",
            "to": "Escalus",
            "label": "family"
        },
        {
            "play_name": "Romeo and Juliet",
            "from": "Paris",
            "to": "Juliet",
            "label": "lover"
        },
        {
            "play_name": "Romeo and Juliet",
            "from": "Romeo",
            "to": "Paris",
            "label": "killer"
        },
        {
            "play_name": "Romeo and Juliet",
            "from": "Lady Capulet",
            "to": "Lady Montague",
            "label": "enemy"
        },
        {
            "play_name": "Romeo and Juliet",
            "from": "Lady Capulet",
            "to": "Lord Montague",
            "label": "enemy"
        },
        {
            "play_name": "Romeo and Juliet",
            "from": "Lord Capulet",
            "to": "Lady Montague",
            "label": "enemy"
        },
        {
            "play_name": "Romeo and Juliet",
            "from": "Lord Capulet",
            "to": "Lord Montague",
            "label": "enemy"
        },
        {
            "play_name": "Romeo and Juliet",
            "from": "Lord Montague",
            "to": "Lady Montague",
            "label": "husband"
        },
        {
            "play_name": "Romeo and Juliet",
            "from": "Lady Montague",
            "to": "Romeo",
            "label": "mother"
        },
        {
            "play_name": "Romeo and Juliet",
            "from": "Lord Montague",
            "to": "Romeo",
            "label": "father"
        },
        {
            "play_name": "Romeo and Juliet",
            "from": "Mercutio",
            "to": "Romeo",
            "label": "friend"
        },
        {
            "play_name": "Romeo and Juliet",
            "from": "Mercutio",
            "to": "Benvolio",
            "label": "friend"
        },
        {
            "play_name": "Romeo and Juliet",
            "from": "Benvolio",
            "to": "Lord Montague",
            "label": "nephew"
        },
        {
            "play_name": "Romeo and Juliet",
            "from": "Benvolio",
            "to": "Romeo",
            "label": "cousin"
        },
        {
            "play_name": "Romeo and Juliet",
            "from": "Mercutio",
            "to": "Escalus",
            "label": "family"
        },
        {
            "play_name": "Romeo and Juliet",
            "from": "Tybalt",
            "to": "Lady Capulet",
            "label": "nephew"
        },
        {
            "play_name": "Romeo and Juliet",
            "from": "Tybalt",
            "to": "Juliet",
            "label": "cousin"
        },
        {
            "play_name": "Romeo and Juliet",
            "from": "Tybalt",
            "to": "Lord Montague",
            "label": "enemy"
        },
        {
            "play_name": "Romeo and Juliet",
            "from": "Tybalt",
            "to": "Lady Montague",
            "label": "enemy"
        },
        {
            "play_name": "Romeo and Juliet",
            "from": "Tybalt",
            "to": "Mercutio",
            "label": "killer"
        },
        {
            "play_name": "Romeo and Juliet",
            "from": "Romeo",
            "to": "Tybalt",
            "label": "killer"
        },
        {
            "play_name": "Romeo and Juliet",
            "from": "Friar Laurence",
            "to": "Romeo",
            "label": "friend"
        },
        {
            "play_name": "Romeo and Juliet",
            "from": "Friar Laurence",
            "to": "Juliet",
            "label": "friend"
        },
        {
            "play_name": "Romeo and Juliet",
            "from": "Balthasar",
            "to": "Romeo",
            "label": "servant"
        },
        {
            "play_name": "Romeo and Juliet",
            "from": "Sampson",
            "to": "Lord Capulet",
            "label": "servant"
        },
        {
            "play_name": "Romeo and Juliet",
            "from": "Gregory",
            "to": "Lord Capulet",
            "label": "servant"
        },
        {
            "play_name": "Romeo and Juliet",
            "from": "Sampson",
            "to": "Gregory",
            "label": "friend"
        },
        {
            "play_name": "Romeo and Juliet",
            "from": "Peter",
            "to": "Lord Capulet",
            "label": "servant"
        },
        {
            "play_name": "Romeo and Juliet",
            "from": "Abram",
            "to": "Lord Montague",
            "label": "servant"
        },
        {
            "play_name": "Romeo and Juliet",
            "from": "the Nurse ",
            "to": "Juliet",
            "label": "servant"
        },
        {
            "play_name": "Romeo and Juliet",
            "from": "Romeo",
            "to": "Rosaline",
            "label": "lover"
        }
    ]
}